[
    {
        "name": "Elysia",
        "iconSource": "/src/assets/signets/blessings/elysia_signet.webp",
        "charSignets": [
            {
                "suitName" : "Valkyrie Blastmetal",
                "type": "Exclusive",
                "signets" : [
                    {
                        "name": "Blessing of Bolt",
                        "description": "Ultimate restores 50 Astral Ring Intensity and resets Stellar Outburst's CD. During Stellar Outburst, aerial Weapon Enhanced ATK has enhanced follow-up ability. Ultimate deals 1200% ATK of bonus Fire DMG. Valkyrie Blastmetal's Weapon Enhanced ATK deals 600% ATK of bonus Fire DMG."
                    },
                    {
                        "name": "Blessing of Sky Blitz",
                        "description": "The character has Iron Body while in the air, and deals 40% bonus Total DMG when in Iron Body or Invincibility."
                    },
                    {
                        "name": "Blessing of Readiness",
                        "description": "During Stellar Outburst, the first 2 aerial Weapon Enhanced ATKs do not consume Quantum Mech Energy and each restores 5 SP and reduces Ultimate CD by 2s on hit. Weapon Skills and Ultimate deal 40% bonus Fire DMG."
                    },
                    {
                        "name": "Blessing of Primer",
                        "description": "Stage 1 Leap becomes Weapon Enhanced ATK SEQ 3, and restores 5 Hammering Feel or Quantum Mech Energy. Stage 2 Leap comes with an attack which deals 300% x 2 ATK of Fire DMG. Combo ATK has a larger range and consumes all Hammering Feel stacks. Each stack consumed makes Combo ATK deals 400% ATK of bonus Fire DMG per hit. With full Astral Ring Intensity, enemies take 50% bonus Fire DMG from the character (independent)."
                    },
                    {
                        "name": "Blessing of Proficiency",
                        "description": "After Stage 2 Leap, the next Weapon Enhanced ATK does not const Hammering Feel. After consuming 5 stacks of Hammering Feel, the current Combo ATK deals 40% bonus Total DMG, and its last hit deals 3000% ATK of bonus Fire DMG."
                    }
                ]
            },
            {
                "suitName" : "Valkyrie Boltstorm",
                "type": "Exclusive",
                "signets" : [
                    {
                        "name": "Blessing of Vivace",
                        "description": "During Stellar Outburst, 2 extra exclusive marks are created. Rapid Shot can activate Domain Resonance marks. When hitting enemies, the exclusive marks unleash chain lightning which deals 1200% x 3 ATK of Lightning DMG to each enemy. Each mark can only trigger chain lightning once per second. The mark is removed after triggering 4 times or when Stellar Outburst ends. Stellar Outburst's duration is reduced to 15s. When not in Stellar Outburst, the character restores 15 Astral Ring Intensity on hit. CD: 1s."
                    },
                    {
                        "name": "Blessing of Resolution",
                        "description": "When the character triggers follow-up attacks after unleashing Explosive Device, she immediately restores 200 Rapid Shot Energy plus 60 Astral Ring Intensity if Stellar Outburst is inactive. During Rapid Shot, the character gains 1 stack of Survey Marker every 0.2s. Casting Targeted Bombardment consumes all Survey Markers, and each stack consumed deals 120% ATK of bonus Lightning DMG, up to 3 stacks. When Astral Ring is active, the maximum stacks cap at 10, and the CD for grenades is reduced to 5s."
                    },
                    {
                        "name": "Blessing of Meditation",
                        "description": "During Ultimate, Time-frozen Domain is triggered which additionally deals 1500% ATK of bonus Lightning DMG and restores 200 Rapid Shot Energy."
                    },
                    {
                        "name": "Blessing of Improvisation",
                        "description": "When not in Stellar Outburst, Rapid Shot deals 55% ATK of bonus Lightning DMG. After absorbing Energy Catalyst, the next attack creates a black hole which continuously gathers enemies in a large area."
                    },
                    {
                        "name": "Blessing of Sparkling Lightning",
                        "description": "When not in Stellar Outburst, Rapid Shot deals 45% ATK of bonus Lightning DMG per hit and enemies drop Energy Catalyst on hit. The character can absorb Energy Catalyst when near to obtain 140 Rapid Shot Energy and trigger Targeted Bombardment (considered Weapon Skill). Additionally, if her Astral Ring is fully charged in 7s, she deals 40% bonus Total DMG; Rapid Shot consts no Rapid Shot Energy and she restores 30 HP per 0.5s. During Rapid Shot, her Move Speed increases by 100%. After an Energy Catalyst drops or is absorbed, no more can drop in 7s."
                    }
                ]
            },
            {
                "suitName" : "Deep Anchor: First Light",
                "type": "Exclusive",
                "signets" : [
                    {
                        "name": "Blessing of Initial Dawning",
                        "description": "Thunder in Clear Skies deals 600% ATK of bonus Lighting DMG. During Thunderous Blazar, triggering Ultimate Evasion Skill extends Thunderous Blazar's duration by 3s. During Overheat, triggering Ultimate Evasion Skill clears Overheat."
                    },
                    {
                        "name": "Blessing of Stellar Drive",
                        "description": "Casting Ultimate or entering Stellar Outburst fully replenishes Ultimate Evasion Skill charges. Every time Ultimate Evasion Skill is triggered, weapon skills deal 10% bonus Total DMG and Ultimate deals 1500% ATK of bonus Lightning DMG for 15s, stacking up to 3 times. Retriggering refreshes duration. The effect ends when Ultimate hits. The character enters Thunderous Pulse upon triggering Ultimate Evasion Skill when not in Overheat."
                    },
                    {
                        "name": "Blessing of Sudden Thunderbolt",
                        "description": "The character deals 25% bonus Lightning DMG. Using Thunder in Clear Skies or Lightning Flash Anchor can activate the Domain Resonance mark 2 more times. CD: 0.7s. Triggering Ultimate Evasion Skill restores 2 Domain Resonance mark activation charges."
                    },
                    {
                        "name": "Blessing of Effortlessness",
                        "description": "Basic ATK, Combo ATK, and Charged ATK deal 30% bonus Lightning DMG. Triggering Ultimate Evasion Skill grants 1 stack (3 stacks max). The next Basic ATK SEQ 4, Thunder in Clear Skies, or Lightning Flash Anchor deals 1000% ATK of bonus Lightning DMG for each stack and consumes all stacks."
                    },
                    {
                        "name": "Blessing of Increment",
                        "description": "Enemies hit by the electromagnetic field activated by the Domain Resonance mark will be electroshocked multiple times and take 160% x 3 ATK of Lightning DMG (DMG source: Resonance)"
                    }
                ]
            },
            {
                "suitName" : "Lone Planetfarer",
                "type": "Exclusive",
                "signets" : [
                    {
                        "name": "Blessing of Lovely Wishes",
                        "description": "During Astral Ring Charging: Basic ATK SEQ 3 in Planet Quaker form deals damage over time to enemies hit, dealing multiple hits that total up to 600% ATK of Lightning DMG to enemies in the range over 1s. This counts as Basic ATK and Ultimate DMG. Basic ATKs (including Combo ATKs and Charged ATKs) deal 50% more Lightning DMG."
                    },
                    {
                        "name": "Blessing of Cosmos",
                        "description": "During Astral Ring Charging: Basic ATK SEQ 4 in Planet Quaker form deals damage over time to enemies hit, dealing multiple hits that total up to 2400% ATK of Lightning DMG to enemies in the range over 1s. This counts as Basic ATK and Ultimate DMG. Combo ATK deals an additional 2000% ATK of Lightning DMG. Casting Combo ATK refreshes the duration of Planet Quaker form and Weapon Skill CD. Casting Weapon Skill restores 160 Intelligence."
                    },
                    {
                        "name": "Blessing of Lonesome Feathers",
                        "description": "When Weapon Skill or Combo ATK hits enemies, they take 40% more Total DMG for 15s. Retriggering refreshes the duration."
                    },
                    {
                        "name": "Blessing of Deep Love",
                        "description": "During Stellar Outburst: When Celestial Rupture hits an enemy, it deals 1200% ATK of Lightning DMG to enemies in a large range. Lightning DMG dealt by Combo ATKs is increased by 60%."
                    },
                    {
                        "name": "Blessing of Abyssal Aid",
                        "description": "During Stellar Outburst: The duration of Stellar Outburst is increased to 35s. When Intelligence is full, hold [ATK] to cast Combo ATK and enter Intelligence Unleashed Mode. Every hit on an enemy deals an additional 450% ATK of Lightning DMG and can trigger Ultimate Evasion Skill. When Celestial Rupture hits an enemy, Ultimate Evasion Skill CD is reduced by 6s. Casting Weapon Skill restores 160 Intelligence and reduces Astral Ring CD to 5s. When exiting Stellar Outburst, Astral Ring Intensity is fully restored."
                    }
                ]
            },
            {
                "suitName" : "Ba-Dum! Fiery Wishing Star",
                "type": "Exclusive",
                "signets" : [
                    {
                        "name": "Blessing of Dazzling Joy",
                        "description": "In Merriment state, Basic ATK deals an additional 1000% ATK of Fire DMG, Basic ATK and Passion Mark's explosion on hit increase combo hit count by 10."
                    },
                    {
                        "name": "Blessing of Fulfilled Wishes",
                        "description": "Ultimate will summon 8 Majestic Fortune Drums (count as summoned entities). You can double jump between Majestic Fortune Drums, each jump causing 1 Resonance Divine Drum to resonate and explode (counts as Weapon Skill), dealing 500% ATK of Fire DMG to all enemies, restoring 12 SP, and reducing Ultimate CD by 2s. After the last Resonance Divine Drum explodes, immediately jump to perform a downward Combo ATK, dealing 1000% ATK of Fire DMG. Total DMG dealt by Ultimate and Majestic Fortune Drums increases by 100%."
                    },
                    {
                        "name": "Blessing of Great Fortune",
                        "description": "In Merriment state: Basic ATK starts from SEQ 3, ground or aerial SEQ 4 can be connected into each other, Immaculate Duet deals an additional 2025% ATK of Fire DMG and detonates 3 more Passion Marks; Merriment state no longer has a time limit, perform 2 Immaculate Duets and exit Merriment state to refresh Ultimate Evasion Skill's CD; Fully recovers Astral Ring Intensity at the start of a battle."
                    },
                    {
                        "name": "Blessing of Serendipitous Luck",
                        "description": "Triggering Ultimate Evasion Skill increases Total DMG by 60% for 15s. Retriggering refreshes duration."
                    },
                    {
                        "name": "Blessing of Pleasant Dreams",
                        "description": "Ultimate deals an additional 1500% ATK of Fire DMG. Within 10s of casting Ultimate, each double jump reduced Ultimate Evasion Skill CD by 2s and increases Fire DMG dealt by 11% (max 99%); DMG increase's rate and duration refreshed by retriggering."
                    }
                ]
            }

        ]
    },
    {
        "name": "Kevin",
        "iconSource": "/src/assets/signets/others/kevin_signet.webp",
        "signets": [
            {
                "name": "text",
                "type": "Core",
                "description": "desc"
            },
            {
                "name": "text",
                "type": "Enchanced",
                "description": "desc"
            }
        ]
    }
]